class IDException(Exception):
    pass


def add_id(id_list, employee_id):
    if not employee_id.startswith('01'):
        raise IDException("Invalid employee ID")
    id_list.append(employee_id)
    return id_list

# У цьому прикладі ми створили клас IDException, який успадковує клас Exception. 
# Це дозволяє нам створити власний виняток, щоб використовувати його для специфічних ситуацій.
# Функція add_id() приймає список id_list і ідентифікатор користувача employee_id. 
# Спочатку вона перевіряє, чи employee_id починається з '01'. Якщо це не так, 
# вона викликає виняток IDException з повідомленням про недійсний ідентифікатор користувача.
# Якщо employee_id починається з '01', він додається до списку id_list, а потім оновлений список повертається.
# Тепер ви можете використовувати функцію add_id() для додавання ідентифікаторів користувачів до списку, 
# забезпечуючи перевірку на відповідність заданим правилам. Якщо employee_id не починається з '01', 
# буде викликано виняток IDException, який можна перехопити і обробити на вищому рівні коду.