def sequence_buttons(string):
    button_map = {
        '1': '.,?!:', '2': 'ABC', '3': 'DEF',
        '4': 'GHI', '5': 'JKL', '6': 'MNO',
        '7': 'PQRS', '8': 'TUV', '9': 'WXYZ',
        '0': ' '
    }
    
    sequence = ''
    string = string.upper()
    
    for char in string:
        for key in button_map:
            if char in button_map[key]:
                count = button_map[key].index(char) + 1
                sequence += key * count
    
    return sequence

# Спершу ми створюємо словник button_map, який містить символи, які відповідають кожній кнопці на телефоні.

# Потім ми ітеруємо по кожному символу введеного рядка. Для кожного символу ми перевіряємо, чи він є в одному зі списків символів в button_map. Якщо символ є в списку, ми додаємо до послідовності sequence кількість натискань на відповідну кнопку, що необхідна для введення цього символу.

# На кінці ми повертаємо послідовність кнопок, яку необхідно натиснути, щоб ввести введений рядок. Функція також ігнорує символи, які не входять до зазначеного списку.