def encode(data):
    if not data:
        return []
    else:
        value = data[0]
        count = 1
        while count < len(data) and data[count] == value:
            count += 1
        return [value, count] + encode(data[count:])


        # Ця функція приймає як вхідні дані список або рядок елементів і повертає 
        # закодований список змінних значень і підрахунків. Він працює, беручи перше 
        # значення з вхідних даних, підраховуючи, скільки разів воно повторюється поспіль, 
        # а потім додає це значення та підраховує до результату. Потім функція рекурсивно 
        # кодує решту вхідних даних.